app/views/garments/_form.html.erb

SELECT "brands".* FROM "brands"
---
    <%= f.label :brand_id, 'Brand' %>
    <%= f.collection_select :brand_id, Brand.all, :id, :name, include_blank: true %>

SELECT "occasions".* FROM "occasions"
---
    <p>Occasions: </p>
    <% Occasion.all.each do |item| %>