app/views/garments/show.html.erb

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 53], ["LIMIT", 1]]
---

<% if @garment.brand.present?%>

SELECT "occasions".* FROM "occasions" INNER JOIN "garments_occasions" ON "occasions"."id" = "garments_occasions"."occasion_id" WHERE "garments_occasions"."garment_id" = $1  [["garment_id", 96]]
---

        <% @garment.occasions.each do |item| %>

SELECT "users".* FROM "users" INNER JOIN "garments_users" ON "users"."id" = "garments_users"."user_id" WHERE "garments_users"."garment_id" = $1  [["garment_id", 195]]
SELECT  1 AS one FROM "users" INNER JOIN "garments_users" ON "users"."id" = "garments_users"."user_id" WHERE "garments_users"."garment_id" = $1 AND "users"."id" = $2 LIMIT $3  [["garment_id", 195], ["id", 25], ["LIMIT", 1]]
---

<% if @garment.like_from_users.include?(@current_user) %>

SELECT "comments".* FROM "comments" WHERE "comments"."garment_id" = $1  [["garment_id", 184]]
---

<% @garment.comments.each do |item| %>