app/views/collocations/_form.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."collocation_id" = $1  [["collocation_id", 93]]
---

    <% if @collocation.photos.present? %>

SELECT "garments".* FROM "garments"
---
    <p>Must-Haves Items: </p>
    <% Garment.all.each do |item| %>