app/views/collocations/_form.html.erb

SELECT "garments".* FROM "garments"
---
    <p>Must-Haves Items: </p>
    <% Garment.all.each do |item| %>