app/views/collocations/show.html.erb


        <% @collocation.garments.each do |item|  %>
---
SELECT "garments".* FROM "garments" INNER JOIN "collocations_garments" ON "garments"."id" = "collocations_garments"."garment_id" WHERE "collocations_garments"."collocation_id" = $1  [["collocation_id", 51]]