app/views/collocations/show.html.erb

SELECT "photos".* FROM "photos" WHERE "photos"."collocation_id" = $1  [["collocation_id", 55]]
---

<% if @collocation.photos.present? %>

SELECT "photos".* FROM "photos" WHERE "photos"."collocation_id" = $1  [["collocation_id", 71]]
---
        <br>
        <% @collocation.photos.each do |item| %>

SELECT "garments".* FROM "garments" INNER JOIN "collocations_garments" ON "garments"."id" = "collocations_garments"."garment_id" WHERE "collocations_garments"."collocation_id" = $1  [["collocation_id", 74]]
---

        <% @collocation.garments.each do |item|  %>