app/views/users/show.html.erb

    <ul>
        <% @user.collocations.each do |item| %>
---
SELECT "collocations".* FROM "collocations" WHERE "collocations"."user_id" = $1  [["user_id", 11]]