app/controllers/brands_controller.rb

  def create
    @brand = Brand.create brand_params
---
INSERT INTO "brands" ("name", "country", "introduction", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "ddd"], ["country", "ddd"], ["introduction", "ddd"], ["created_at", "2022-08-28 13:34:28.052161"], ["updated_at", "2022-08-28 13:34:28.052161"]]

  def show
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]

  def edit
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]

  def update
    @brand = Brand.find params[:id]

    if @brand.update brand_params
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = $1 LIMIT $2  [["id", 115], ["LIMIT", 1]]
UPDATE "brands" SET "name" = $1, "country" = $2, "updated_at" = $3 WHERE "brands"."id" = $4  [["name", "dddaaaaaa"], ["country", "dddaaaaaaa"], ["updated_at", "2022-08-28 13:39:50.628559"], ["id", 57]]

  def destroy
    Brand.destroy params[:id]
---
DELETE FROM "brands" WHERE "brands"."id" = $1  [["id", 115]]