app/controllers/collocations_controller.rb

SELECT  "collocations".* FROM "collocations" WHERE (eeee) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "collocations" ("title", "introduction", "image", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test4"], ["introduction", ""], ["image", "vsy3qxegc5hkkzhmcar9"], ["user_id", 22], ["created_at", "2022-09-01 07:28:16.822585"], ["updated_at", "2022-09-01 07:28:16.822585"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 195], ["LIMIT", 1]]
INSERT INTO "photos" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "http://hhhhh"], ["created_at", "2022-08-31 02:56:56.997704"], ["updated_at", "2022-08-31 02:56:56.997704"]]
---
  def create
    # raise "hell"

    @collocation = Collocation.new collocation_params

    if params[:collocation][:image].present?
      response = Cloudinary::Uploader.upload params[:collocation][:image]
      @collocation.image = response["public_id"]
    end

    # User check
    @collocation.user_id = @current_user.id
    @collocation.save

    # check if the collocation is saved correctly
    if @collocation.persisted?

      # if user tick garment checkbox
      if params[:garment_id].present?
        @collocation.garments << Garment.find(params[:garment_id])
      end # if params[:garment_id].present?


      # User can add as many photos as they want
      if params[:photo_links].present?
        photo_links = params[:photo_links]
        photo_links.each do |pic|
          photo_create = Photo.create(image: pic)

SELECT "collocations".* FROM "collocations"
---
  def index
    @collocations = Collocation.all

SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
---
  def show
    @collocation = Collocation.find params[:id]

SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
---
  def edit

    @collocation = Collocation.find params[:id]

SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 93], ["LIMIT", 1]]
DELETE FROM "collocations" WHERE "collocations"."id" = $1  [["id", 72]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 199], ["LIMIT", 1]]
SELECT "garments".* FROM "garments"
SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."collocation_id" = $1  [["collocation_id", 93]]
SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]
UPDATE "photos" SET "collocation_id" = $1, "updated_at" = $2 WHERE "photos"."id" = $3  [["collocation_id", 82], ["updated_at", "2022-08-30 12:37:16.312134"], ["id", 35]]
---
  def update
    # raise "hell"

    @collocation = Collocation.find params[:id]

    # Check AGAIN that this collocation belongs to the logged-in user,
    # since people can work out the edit URL
    if @collocation.user_id != @current_user.id
      redirect_to login_path
      return
    end # if

    # if user tick garment checkbox in edit
    if params[:garment_id].present?
      @collocation.garments.destroy_all
      @collocation.garments << Garment.find(params[:garment_id])
    end # if params[:garment_id].present?


    # the photos they add before, edit or not
    # check if it has photos or not before edit first
    if @collocation.photos.present?
      @collocation.photos.each do |photo|
        photo_id = photo.id.to_s # 16 -> "16"
        photo.update(image: params[:photo_links_edit][photo_id])

INSERT INTO "photos" ("image", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["image", "[\"38\", \"http://fff\"]"], ["created_at", "2022-08-31 02:52:53.317014"], ["updated_at", "2022-08-31 02:52:53.317014"]]
---
    if params[:photo_links].present?
      photo_links = params[:photo_links]
      photo_links.each do |pic|
        @collocation.photos << Photo.create(image: pic)

UPDATE "collocations" SET "image" = $1, "updated_at" = $2 WHERE "collocations"."id" = $3  [["image", "iybmhb4f1jtduv2p9jdw"], ["updated_at", "2022-09-01 07:31:43.466267"], ["id", 93]]
---
    end


    if @collocation.update collocation_params

DELETE FROM "collocations" WHERE "collocations"."id" = $1  [["id", 92]]
---
  def destroy
    Collocation.destroy params[:id]