app/controllers/collocations_controller.rb

SELECT "collocations".* FROM "collocations" WHERE "collocations"."id" IN ($1, $2)  [["id", 0], ["id", 0]]
SELECT "garments".* FROM "garments" WHERE "garments"."id" IN ($1, $2)  [["id", 175], ["id", 176]]
---
  def create

    @collocation = Collocation.new collocation_params
    @collocation.user_id = @current_user.id
    @collocation.save

    # if user tick garment checkbox
    if params[:garment_id].present?
      @collocation.garments << Garment.find(params[:garment_id])

SELECT  "collocations".* FROM "collocations" WHERE "collocations"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
---
  def edit

    @collocation = Collocation.find params[:id]

UPDATE "collocations" SET "title" = $1, "updated_at" = $2 WHERE "collocations"."id" = $3  [["title", "dddddddddd"], ["updated_at", "2022-08-29 15:59:45.778794"], ["id", 51]]
---
  def update
    @collocation = Collocation.find params[:id]

    # Check AGAIN that this collocation belongs to the logged-in user,
    # since people can work out the edit URL
    if @collocation.user_id != @current_user.id
      redirect_to login_path
      return
    end # if


    if @collocation.update collocation_params

DELETE FROM "collocations" WHERE "collocations"."id" = $1  [["id", 53]]
---
  def destroy
    Collocation.destroy params[:id]