app/controllers/collocations_controller.rb

  def update
    collocation = Collocation.find params[:id]

    collocation.update collocation_params
---
UPDATE "collocations" SET "title" = $1, "introduction" = $2, "updated_at" = $3 WHERE "collocations"."id" = $4  [["title", "aaadddddd"], ["introduction", "aaaaaadsfgasdfasdfasdf"], ["updated_at", "2022-08-29 01:22:22.662565"], ["id", 23]]

  def destroy
    Collocation.destroy params[:id]
---
DELETE FROM "collocations" WHERE "collocations"."id" = $1  [["id", 22]]