app/controllers/comments_controller.rb

  def create
    # raise "hell"

    @comment = Comment.create comment_params

    @comment.user_id = @current_user.id
    @comment.save
---
INSERT INTO "comments" ("content", "garment_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "ddddd"], ["garment_id", 184], ["created_at", "2022-08-30 17:41:08.324048"], ["updated_at", "2022-08-30 17:41:08.324048"]]
UPDATE "comments" SET "user_id" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["user_id", 20], ["updated_at", "2022-08-31 05:01:38.397499"], ["id", 7]]

  def destroy
    # raise "hell"
    # @garment = Comment.find(params[:id]).garment
    comment = Comment.destroy params[:id] # will also return that destroyed comment
---
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 47]]