app/controllers/garments_controller.rb

  def create

    # raise "hell"

    @garment = Garment.new garment_params

    if params[:garment][:image].present?
      response = Cloudinary::Uploader.upload params[:garment][:image]
      @garment.image = response["public_id"]
    end

    @garment.save

    # if user tick garment checkbox
    if params[:occasion_ids].present?
      # like what we do in seeds.rb
      # o1.garments << g1 << g3 << g4 << g5 << g6
      @garment.occasions << Occasion.find(params[:occasion_ids])
---
INSERT INTO "garments" ("name", "fabrication", "image", "created_at", "updated_at", "brand_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "test1"], ["fabrication", ""], ["image", "uykb3gpxh6dajgopavkv"], ["created_at", "2022-09-01 04:59:18.630331"], ["updated_at", "2022-09-01 04:59:18.630331"], ["brand_id", 119]]
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 97], ["LIMIT", 1]]
SELECT  "occasions".* FROM "occasions" WHERE "occasions"."id" = $1 LIMIT $2  [["id", 103], ["LIMIT", 1]]

  def index
    @garments = Garment.all
---
SELECT "garments".* FROM "garments"

  def show
    @garment = Garment.find params[:id]
---
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 189], ["LIMIT", 1]]

  def like
    # raise "hell"

    @garment = Garment.find params[:id]

    unless @garment.like_from_users.include?(@current_user)
      @garment.like_from_users << @current_user
    else
      @garment.like_from_users.delete(@current_user)
---
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 182], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 191], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "garments_users" ON "users"."id" = "garments_users"."user_id" WHERE "garments_users"."garment_id" = $1 AND "users"."id" = $2 LIMIT $3  [["garment_id", 184], ["id", 20], ["LIMIT", 1]]
DELETE FROM "garments" WHERE "garments"."id" = $1  [["id", 191]]

  def edit
    @garment = Garment.find params[:id]
---
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]

  def update
    @garment = Garment.find params[:id]

    # if user tick garment checkbox in edit
    if params[:occasion_ids].present?
      @garment.occasions.destroy_all
      @garment.occasions << Occasion.find(params[:occasion_ids])
    end

    # need to delete :image in def garment_params, or the re-upload will not work
    if params[:garment][:image].present?
      response = Cloudinary::Uploader.upload params[:garment][:image]
      @garment.image = response["public_id"]
    end


    # in case there is an error and rollback
    if @garment.update garment_params
---
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 201], ["LIMIT", 1]]
DELETE FROM "garments" WHERE "garments"."id" = $1  [["id", 193]]
SELECT "occasions".* FROM "occasions" INNER JOIN "garments_occasions" ON "occasions"."id" = "garments_occasions"."occasion_id" WHERE "garments_occasions"."garment_id" = $1  [["garment_id", 192]]
SELECT  "garments".* FROM "garments" WHERE "garments"."id" = $1 LIMIT $2  [["id", 193], ["LIMIT", 1]]
UPDATE "garments" SET "image" = $1, "updated_at" = $2 WHERE "garments"."id" = $3  [["image", "iipreughhqhtkadwchbo"], ["updated_at", "2022-09-01 07:16:33.480971"], ["id", 206]]

  def destroy
    Garment.destroy params[:id]
---
DELETE FROM "garments" WHERE "garments"."id" = $1  [["id", 206]]

  def search
    if params[:search].blank?
      redirect_to garments_path
      return
    else
      # @results = Garment.all.where("lower(name) LIKE :search", search: "%#{params[:search]}%")
      @match_garments = Garment.where("name ILIKE ?", "%#{params[:search]}%")
      @match_brands = Brand.where("name ILIKE ?", "%#{params[:search]}%")
      @match_garment_occasions = Garment.joins(:occasions).where("title ILIKE ?", "%#{params[:search]}%")
---
SELECT "garments".* FROM "garments" WHERE (garments.name ILIKE '%paris%')
SELECT "brands".* FROM "brands" WHERE (lower(name) LIKE '%sweater%')
SELECT "garments".* FROM "garments" INNER JOIN "garments_occasions" ON "garments_occasions"."garment_id" = "garments"."id" INNER JOIN "occasions" ON "occasions"."id" = "garments_occasions"."occasion_id" WHERE (title ILIKE '%school%')
SELECT "occasions".* FROM "occasions" INNER JOIN "garments_occasions" ON "garments_occasions"."occasion_id" = "occasions"."id" INNER JOIN "garments" ON "garments"."id" = "garments_occasions"."garment_id" WHERE (name ILIKE '%sweater%')