app/controllers/garments_controller.rb

  def create

    @garment = Garment.create garment_params

    # if user tick garment checkbox
    if params[:occasion_ids].present?
      # like what we do in seeds.rb
      # o1.garments << g1 << g3 << g4 << g5 << g6
      @garment.occasions << Occasion.find(params[:occasion_ids])
---
SELECT "occasions".* FROM "occasions" WHERE "occasions"."id" IN ($1, $2)  [["id", 88], ["id", 89]]

  def update
    garment = Garment.find params[:id]

    garment.update garment_params
---
UPDATE "garments" SET "name" = $1, "updated_at" = $2 WHERE "garments"."id" = $3  [["name", "JAVA Shortsssssssssssssss"], ["updated_at", "2022-08-28 12:04:51.451289"], ["id", 97]]

  def destroy
    Garment.destroy params[:id]
---
DELETE FROM "garments" WHERE "garments"."id" = $1  [["id", 97]]