app/controllers/occasions_controller.rb

  def create
    @occasion = Occasion.create occasion_params
---
INSERT INTO "occasions" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "For Job Interview"], ["created_at", "2022-08-28 16:02:31.491129"], ["updated_at", "2022-08-28 16:02:31.491129"]]

  def index
    @occasions = Occasion.all
---
SELECT "occasions".* FROM "occasions"

  def show
    @occasion = Occasion.find params[:id]
---
SELECT  "occasions".* FROM "occasions" WHERE "occasions"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def edit
    @occasion = Occasion.find params[:id]
---
SELECT  "occasions".* FROM "occasions" WHERE "occasions"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]

  def update
    @occasion = Occasion.find params[:id]

    if @occasion.update occasion_params
---
SELECT  "occasions".* FROM "occasions" WHERE "occasions"."id" = $1 LIMIT $2  [["id", 32], ["LIMIT", 1]]
UPDATE "occasions" SET "title" = $1, "updated_at" = $2 WHERE "occasions"."id" = $3  [["title", "For Job Interviewwwwww"], ["updated_at", "2022-08-28 16:02:41.677233"], ["id", 31]]

  def destroy
    Occasion.destroy params[:id]
---
DELETE FROM "occasions" WHERE "occasions"."id" = $1  [["id", 32]]