app/controllers/users_controller.rb

  def create
    @user = User.create user_params
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def edit
    # it is already @current_user

    @user = User.find params[:id]
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  def update

    @user = User.find params[:id]

    if @user.id != @current_user.id
      redirect_to login_path
    end # if

    if @current_user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "fff"], ["updated_at", "2022-08-30 01:01:26.403952"], ["id", 19]]

  def destroy
    User.destroy params[:id]
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 18]]