app/models/brand.rb

    def self.search(search)
---
SELECT "brands".* FROM "brands" WHERE (brands.name ILIKE '%paris%')