app/models/garment.rb

SELECT "garments".* FROM "garments" WHERE (garments.name ILIKE '%paris%')
---
    def self.search(search)