app/views/occasions/show.html.erb

<ul>
    <% @occasion.garments.each do |item| %>
---
SELECT "garments".* FROM "garments" INNER JOIN "garments_occasions" ON "garments"."id" = "garments_occasions"."garment_id" WHERE "garments_occasions"."occasion_id" = $1  [["occasion_id", 26]]