app/views/brands/show.html.erb

    <ul>
        <% @brand.occasion.each do |item| %>
---
SELECT "occasions".* FROM "occasions" INNER JOIN "garments_occasions" ON "occasions"."id" = "garments_occasions"."occasion_id" INNER JOIN "garments" ON "garments_occasions"."garment_id" = "garments"."id" WHERE "garments"."brand_id" = $1  [["brand_id", 53]]

<ul>
    <% @brand.garments.each do |item| %>
---
SELECT "garments".* FROM "garments" WHERE "garments"."brand_id" = $1  [["brand_id", 53]]